 interface IHoliday //! интерфейс IHoliday, который определяет метод beerDay(), который должен быть реализован классами, которые хотят поддерживать функциональность празднования дня рождения
{
     void beerDay(); //? метод beerDay(), который должен быть реализован классами, которые хотят поддерживать функциональность празднования дня рождения. Этот метод может изменять состояние объекта, например, увеличивать возраст, изменять настроение или вызывать другие методы, связанные с празднованием дня рождения.
    
}